# Go To Market (G2M) insights to investment in Cab Compnay.


<b>Objective of this project:</b>

Provide actionable insights or recommendations to help a firm in identifying the right Cab company (Yellow or Pink ) for investing.

## Data Exploration

### Data Preprocessing

In [1]:
import pandas as pd
import numpy as np

In [119]:
cab_data = pd.read_csv(
    "/Users/mohsenbahremani/Myfiles/Data Glacier/Week 2/Cab_Data.csv")
city = pd.read_csv(
    "/Users/mohsenbahremani/Myfiles/Data Glacier/Week 2/city.csv")
Transaction_ID = pd.read_csv(
    "/Users/mohsenbahremani/Myfiles/Data Glacier/Week 2/Transaction_ID.csv")
customer_ID = pd.read_csv(
    "/Users/mohsenbahremani/Myfiles/Data Glacier/Week 2/Customer_ID.csv")
usholidays = pd.read_csv(
    "/Users/mohsenbahremani/Myfiles/Data Glacier/Week 2/USHolidays.csv")

In [34]:
cab_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 359392 entries, 0 to 359391
Data columns (total 7 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   Transaction ID  359392 non-null  int64
 1   Date of Travel  359392 non-null  int64
 2   Company         359392 non-null  object
 3   City            359392 non-null  object
 4   KM Travelled    359392 non-null  float64
 5   Price Charged   359392 non-null  float64
 6   Cost of Trip    359392 non-null  float64
dtypes: float64(3), int64(2), object(2)
memory usage: 19.2+ MB

"Date of Travel" needs to be changed to date format.

In [121]:
cabdate = cab_data['Date of Travel'].to_list()
startdate = pd.Timestamp('1899-12-29')
cabdates = [startdate + pd.DateOffset(x) for x in cabdate]
cab_data['Date of Travel'] = pd.to_datetime(cabdates,
                                            format='%y-%m-%d')
cab_data

,Transaction ID,Date of Travel,Company,City,KM Travelled,Price Charged,Cost of Trip
0,10000011,2016-01-07,Pink Cab,ATLANTA GA,30.45,370.95,313.6350
1,10000012,2016-01-05,Pink Cab,ATLANTA GA,28.62,358.52,334.8540
2,10000013,2016-01-01,Pink Cab,ATLANTA GA,9.04,125.20,97.6320
3,10000014,2016-01-06,Pink Cab,ATLANTA GA,33.17,377.40,351.6020
4,10000015,2016-01-02,Pink Cab,ATLANTA GA,8.73,114.62,97.7760
...,...,...,...,...,...,...,...
359387,10440101,2018-01-07,Yellow Cab,WASHINGTON DC,4.80,69.24,63.3600
359388,10440104,2018-01-03,Yellow Cab,WASHINGTON DC,8.40,113.75,106.8480
359389,10440105,2018-01-04,Yellow Cab,WASHINGTON DC,27.75,437.07,349.6500
359390,10440106,2018-01-04,Yellow Cab,WASHINGTON DC,8.80,146.19,114.0480
359391,10440107,2018-01-01,Yellow Cab,WASHINGTON DC,12.76,191.58,177.6192

In [4]:
city

                City   Population      Users
0        NEW YORK NY   8,405,837    302,149
1         CHICAGO IL   1,955,130    164,468
2     LOS ANGELES CA   1,595,037    144,132
3           MIAMI FL   1,339,155     17,675
4     SILICON VALLEY   1,177,609     27,247
5      ORANGE COUNTY   1,030,185     12,994
6       SAN DIEGO CA     959,307     69,995
7         PHOENIX AZ     943,999      6,133
8          DALLAS TX     942,908     22,157
9         ATLANTA GA     814,885     24,701
10         DENVER CO     754,233     12,421
11         AUSTIN TX     698,371     14,978
12        SEATTLE WA     671,238     25,063
13         TUCSON AZ     631,442      5,712
14  SAN FRANCISCO CA     629,591    213,609
15     SACRAMENTO CA     545,776      7,044
16     PITTSBURGH PA     542,085      3,643
17     WASHINGTON DC     418,859    127,001
18      NASHVILLE TN     327,225      9,270
19         BOSTON MA     248,968     80,021

In [120]:
city['Population']=[x.replace(',','') for x in city['Population']]
city['Population']=city['Population'].astype(int)
city['Users']=[x.replace(',','') for x in city['Users']]
city['Users']=city['Users'].astype(int)
city.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   City        20 non-null     object
 1   Population  20 non-null     int64
 2   Users       20 non-null     int64
dtypes: int64(2), object(1)
memory usage: 608.0+ bytes

In [43]:
city.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   City        20 non-null     object
 1   Population  20 non-null     object
 2   Users       20 non-null     object
dtypes: object(3)
memory usage: 608.0+ bytes

In [5]:
Transaction_ID

        Transaction ID  Customer ID Payment_Mode
0             10000011        29290         Card
1             10000012        27703         Card
2             10000013        28712         Cash
3             10000014        28020         Cash
4             10000015        27182         Card
...                ...          ...          ...
440093        10440104        53286         Cash
440094        10440105        52265         Cash
440095        10440106        52175         Card
440096        10440107        52917         Card
440097        10440108        51587         Card

[440098 rows x 3 columns]

In [44]:
Transaction_ID.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 440098 entries, 0 to 440097
Data columns (total 3 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   Transaction ID  440098 non-null  int64
 1   Customer ID     440098 non-null  int64
 2   Payment_Mode    440098 non-null  object
dtypes: int64(2), object(1)
memory usage: 10.1+ MB

In [6]:
customer_ID

       Customer ID  Gender  Age  Income (USD/Month)
0            29290    Male   28               10813
1            27703    Male   27                9237
2            28712    Male   53               11242
3            28020    Male   23               23327
4            27182    Male   33                8536
...            ...     ...  ...                 ...
49166        12490    Male   33               18713
49167        14971    Male   30               15346
49168        41414    Male   38                3960
49169        41677    Male   23               19454
49170        39761  Female   32               10128

[49171 rows x 4 columns]

In [45]:
customer_ID.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49171 entries, 0 to 49170
Data columns (total 4 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Customer ID         49171 non-null  int64
 1   Gender              49171 non-null  object
 2   Age                 49171 non-null  int64
 3   Income (USD/Month)  49171 non-null  int64
dtypes: int64(3), object(1)
memory usage: 1.5+ MB

In [9]:
usholidays

           Date         Holiday    WeekDay  Month  Day  Year
0    2004-07-04     4th of July     Sunday      7    4  2004
1    2005-07-04     4th of July     Monday      7    4  2005
2    2006-07-04     4th of July    Tuesday      7    4  2006
3    2007-07-04     4th of July  Wednesday      7    4  2007
4    2008-07-04     4th of July     Friday      7    4  2008
..          ...             ...        ...    ...  ...   ...
337  2006-04-16  Western Easter     Sunday      4   16  2006
338  2017-04-16  Western Easter     Sunday      4   16  2017
339  2014-04-20  Western Easter     Sunday      4   20  2014
340  2019-04-21  Western Easter     Sunday      4   21  2019
341  2011-04-24  Western Easter     Sunday      4   24  2011

[342 rows x 6 columns]

In [46]:
usholidays.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 342 entries, 0 to 341
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Date     342 non-null    object
 1   Holiday  342 non-null    object
 2   WeekDay  342 non-null    object
 3   Month    342 non-null    int64
 4   Day      342 non-null    int64
 5   Year     342 non-null    int64
dtypes: int64(3), object(3)
memory usage: 16.2+ KB

<div class="alert alert-block alert-info">
<b>Missing Value</b> There is no missing value in our entire dataset.
</div>

<b>Merging dataset in one data frame!</b>

In [122]:
cab_data=cab_data.merge(city, how="left", on="City")

In [123]:
cab_data=cab_data.merge(Transaction_ID, how="left", on="Transaction ID")

In [124]:
cab_data=cab_data.merge(customer_ID, how="left", on="Customer ID")

In [67]:
cab_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 359392 entries, 0 to 359391
Data columns (total 14 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   Transaction ID      359392 non-null  int64
 1   Date of Travel      359392 non-null  datetime64[ns]
 2   Company             359392 non-null  object
 3   City                359392 non-null  object
 4   KM Travelled        359392 non-null  float64
 5   Price Charged       359392 non-null  float64
 6   Cost of Trip        359392 non-null  float64
 7   Population          359392 non-null  object
 8   Users               359392 non-null  object
 9   Customer ID         359392 non-null  int64
 10  Payment_Mode        359392 non-null  object
 11  Gender              359392 non-null  object
 12  Age                 359392 non-null  int64
 13  Income (USD/Month)  359392 non-null  int64
dtypes: datetime64[ns](1), float64(3), int64(4), object(6)
memory usage: 41.1+ MB

In [125]:
usholidays['Date']=pd.to_datetime(usholidays['Date'])
cab_data=cab_data.merge(usholidays[['Date',"Holiday"]], how="left", left_on="Date of Travel",right_on ="Date").drop(columns = ['Date'])
cab_data.Holiday=[1 if x is not np.nan else 0 for x in cab_data.Holiday] 
cab_data

,Transaction ID,Date of Travel,Company,City,KM Travelled,Price Charged,Cost of Trip,Population,Users,Customer ID,Payment_Mode,Gender,Age,Income (USD/Month),Holiday
0,10000011,2016-01-07,Pink Cab,ATLANTA GA,30.45,370.95,313.6350,814885,24701,29290,Card,Male,28,10813,0
1,10000012,2016-01-05,Pink Cab,ATLANTA GA,28.62,358.52,334.8540,814885,24701,27703,Card,Male,27,9237,0
2,10000013,2016-01-01,Pink Cab,ATLANTA GA,9.04,125.20,97.6320,814885,24701,28712,Cash,Male,53,11242,1
3,10000014,2016-01-06,Pink Cab,ATLANTA GA,33.17,377.40,351.6020,814885,24701,28020,Cash,Male,23,23327,0
4,10000015,2016-01-02,Pink Cab,ATLANTA GA,8.73,114.62,97.7760,814885,24701,27182,Card,Male,33,8536,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
359560,10440101,2018-01-07,Yellow Cab,WASHINGTON DC,4.80,69.24,63.3600,418859,127001,52392,Cash,Male,24,15651,0
359561,10440104,2018-01-03,Yellow Cab,WASHINGTON DC,8.40,113.75,106.8480,418859,127001,53286,Cash,Male,32,6528,0
359562,10440105,2018-01-04,Yellow Cab,WASHINGTON DC,27.75,437.07,349.6500,418859,127001,52265,Cash,Male,56,7966,0
359563,10440106,2018-01-04,Yellow Cab,WASHINGTON DC,8.80,146.19,114.0480,418859,127001,52175,Card,Male,32,6423,0
359564,10440107,2018-01-01,Yellow Cab,WASHINGTON DC,12.76,191.58,177.6192,418859,127001,52917,Card,Male,20,11284,1

<div class="alert alert-block alert-info">
<b>New Feature</b> Profit is to calculate via:cab_data['profit'] = cab_data['Price Charged'] - 	cab_data['Cost of Trip']
</div>

In [126]:
cab_data['profit'] = cab_data['Price Charged'] - cab_data['Cost of Trip']

## Descriptive analysis

In [138]:
cab_data=cab_data.sort_values("Date of Travel").reset_index().drop("index", axis=1)

In [142]:
cab_data[['KM Travelled','Price Charged', 'Cost of Trip']].describe( )

        KM Travelled  Price Charged   Cost of Trip
count  359565.000000  359565.000000  359565.000000
mean       22.566321     423.432973     286.181027
std        12.233477     274.381119     157.994355
min         1.900000      15.600000      19.000000
25%        12.000000     206.430000     151.200000
50%        22.440000     386.350000     282.480000
75%        32.960000     583.650000     413.683200
max        48.000000    2048.030000     691.200000

In [143]:
city.describe()

         Population          Users
count  2.000000e+01      20.000000
mean   1.231592e+06   64520.650000
std    1.740127e+06   83499.375289
min    2.489680e+05    3643.000000
25%    6.086372e+05   11633.250000
50%    7.845590e+05   23429.000000
75%    1.067041e+06   91766.000000
max    8.405837e+06  302149.000000

In [145]:
Transaction_ID.describe(include ='all')

        Transaction ID    Customer ID Payment_Mode
count     4.400980e+05  440098.000000       440098
unique             NaN            NaN            2
top                NaN            NaN         Card
freq               NaN            NaN       263991
mean      1.022006e+07   23619.513120          NaN
std       1.270455e+05   21195.549816          NaN
min       1.000001e+07       1.000000          NaN
25%       1.011004e+07    3530.000000          NaN
50%       1.022006e+07   15168.000000          NaN
75%       1.033008e+07   43884.000000          NaN
max       1.044011e+07   60000.000000          NaN

In [147]:
customer_ID.describe(include ='all')

         Customer ID Gender           Age  Income (USD/Month)
count   49171.000000  49171  49171.000000        49171.000000
unique           NaN      2           NaN                 NaN
top              NaN   Male           NaN                 NaN
freq             NaN  26562           NaN                 NaN
mean    28398.252283    NaN     35.363121        15015.631856
std     17714.137333    NaN     12.599066         8002.208253
min         1.000000    NaN     18.000000         2000.000000
25%     12654.500000    NaN     25.000000         8289.500000
50%     27631.000000    NaN     33.000000        14656.000000
75%     43284.500000    NaN     42.000000        21035.000000
max     60000.000000    NaN     65.000000        35000.000000